artifacts/phase23/compatibility-first53-assessment-v1/45-kubernetes-shell-fixed-mutation.diff
--- artifacts/phase22/integration/v75-prior-language-results/raw/78-first-kubernetes-shell-fixed-mutation/kubernetes-shell-fixed-mutation/report.json
+++ artifacts/phase23/compatibility-v3/raw/22-first-kubernetes-shell-fixed-mutation/kubernetes-shell-fixed-mutation/report.json
@@ -9031,18 +9031,6 @@
     },
     {
       "code": "static_binding_unresolved",
-      "message": "src/utils/kubernetes-manager.ts: cannot resolve TypeScript binding '../types.js:ResourceTracker'"
-    },
-    {
-      "code": "static_binding_unresolved",
-      "message": "src/utils/kubernetes-manager.ts: cannot resolve TypeScript binding '../types.js:PortForwardTracker'"
-    },
-    {
-      "code": "static_binding_unresolved",
-      "message": "src/utils/kubernetes-manager.ts: cannot resolve TypeScript binding '../types.js:WatchTracker'"
-    },
-    {
-      "code": "static_binding_unresolved",
       "message": "src/index.ts: cannot resolve TypeScript binding 'process'"
     },
     {
@@ -9311,10 +9299,6 @@
     },
     {
       "code": "static_binding_unresolved",
-      "message": "tests/service.test.ts: cannot resolve TypeScript binding '../src/types:CreateNamespaceResponseSchema'"
-    },
-    {
-      "code": "static_binding_unresolved",
       "message": "tests/set_current_context.test.ts: cannot resolve TypeScript binding 'Promise'"
     },
     {
@@ -12256,6 +12240,14 @@
     {
       "code": "static_binding_unresolved",
       "message": "tests/namespace.test.ts: cannot resolve TypeScript binding 'error.message.includes'"
+    },
+    {
+      "code": "static_binding_unresolved",
+      "message": "tests/non_destructive_tools.test.ts: cannot resolve TypeScript binding '../src/index:allTools.filter'"
+    },
+    {
+      "code": "static_binding_unresolved",
+      "message": "tests/non_destructive_tools.test.ts: cannot resolve TypeScript binding '../src/index:destructiveTools.some'"
     },
     {
       "code": "static_binding_unresolved",
