artifacts/phase23/compatibility-first53-assessment-v1/35-filesystem-prefix-vulnerable-mutation.diff
--- artifacts/phase22/integration/v75-prior-language-results/raw/68-first-filesystem-prefix-vulnerable-mutation/filesystem-prefix-vulnerable-mutation/report.json
+++ artifacts/phase23/compatibility-v3/raw/12-first-filesystem-prefix-vulnerable-mutation/filesystem-prefix-vulnerable-mutation/report.json
@@ -11112,8 +11112,8 @@
       "message": "index.ts: cannot resolve TypeScript binding 'error'"
     },
     {
-      "code": "static_flow_unresolved",
-      "message": "SENT-012 at index.ts:845: SDK instance escapes to an unresolved call; protection is not established"
+      "code": "static_binding_unresolved",
+      "message": "index.ts: cannot resolve TypeScript binding 'map'"
     },
     {
       "code": "static_binding_unresolved",
@@ -11125,7 +11125,23 @@
     },
     {
       "code": "static_binding_unresolved",
+      "message": "index.ts: cannot resolve TypeScript binding 'setRequestHandler'"
+    },
+    {
+      "code": "static_binding_unresolved",
+      "message": "index.ts: cannot resolve TypeScript binding 'safeParse'"
+    },
+    {
+      "code": "static_binding_unresolved",
       "message": "index.ts: cannot resolve TypeScript binding 'connect'"
+    },
+    {
+      "code": "static_binding_unresolved",
+      "message": "index.ts: cannot resolve TypeScript binding 'length'"
+    },
+    {
+      "code": "static_flow_unresolved",
+      "message": "SENT-012 at index.ts:845: SDK instance escapes to an unresolved call; protection is not established"
     },
     {
       "code": "static_binding_unresolved",
@@ -12413,10 +12429,6 @@
     },
     {
       "code": "static_binding_unresolved",
-      "message": "index.ts: cannot resolve TypeScript binding 'map'"
-    },
-    {
-      "code": "static_binding_unresolved",
       "message": "index.ts: cannot resolve TypeScript binding 'stats.isDirectory'"
     },
     {
@@ -12562,14 +12574,6 @@
     {
       "code": "static_binding_unresolved",
       "message": "index.ts: cannot resolve TypeScript binding 'lines.push'"
-    },
-    {
-      "code": "static_binding_unresolved",
-      "message": "index.ts: cannot resolve TypeScript binding 'setRequestHandler'"
-    },
-    {
-      "code": "static_binding_unresolved",
-      "message": "index.ts: cannot resolve TypeScript binding 'safeParse'"
     },
     {
       "code": "static_binding_unresolved",
